app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "author", "source", "motto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Ra's House"], ["author", ""], ["source", ""], ["motto", ""], ["created_at", "2018-07-19 18:06:31.412166"], ["updated_at", "2018-07-19 18:06:31.412166"]]
---
  def create
    @house = House.new(house_params)

    if @house.save