app/controllers/members_controller.rb

INSERT INTO "members" ("house_id", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["house_id", 4], ["first_name", "Rahul"], ["last_name", "Sangar"], ["created_at", "2018-07-19 19:23:48.246008"], ["updated_at", "2018-07-19 19:23:48.246008"]]
---
  def create
    @house = House.find(params[:house_id])
    @member = Member.new(member_params)
    @member.house = @house

    if @member.save